Term4/teorver/practice/11.org
#+LATEX_CLASS: general
#+TITLE: Практика 11
#+AUTHOR: Ilya Yaroshevskiy

#+begin_task org
Имеются 2 случайные величина
| /       | <       |         |         |         |         |
| \(\xi\) | \(-2\)  | \(-1\)  | \(0\)   | \(1\)   | \(2\)   |
|---------+---------+---------+---------+---------+---------|
| \(p\)   | \(0.1\) | \(0.3\) | \(0.3\) | \(0.2\) | \(0.1\) |


| /        | <       |         |         |
| \(\eta\) | \(-3\)  | \(1\)   | \(4\)   |
|----------+---------+---------+---------|
| \(p\)    | \(0.4\) | \(0.4\) | \(0.2\) |
Найти: \(\gamma = \xi^2 - \eta\)
#+end_task
#+begin_solution org
| /         |   < |     |     |
| \(\xi^2\) |   0 |   1 |   4 |
|-----------+-----+-----+-----|
| \(p\)     | 0.3 | 0.5 | 0.2 |


|                           / | <      |        |       |
| \(\eta\textbackslash\xi^2\) | 0      | 1      | 4     |
|-----------------------------+--------+--------+-------|
|                          -3 | \(3\)  | \(4\)  | \(7\) |
|                           1 | \(-1\) | \(0\)  | \(3\) |
|                           4 | \(-4\) | \(-3\) | \(0\) |


| /          | <         |         |          |                |                 |         |          |
| \(\gamma\) | -4        |      -3 |       -1 |              0 |               3 |       4 |        7 |
|------------+-----------+---------+----------+----------------+-----------------+---------+----------|
| \(p\)      | \(0.006\) | \(0.1\) | \(0.12\) | \(0.2 + 0.04\) | \(0.08 + 0.12\) | \(0.2\) | \(0.08\) |
#+end_solution
#+begin_task org
Игрок играет в орлянку по схеме с удвоением. Если он проиграл, то следущий раз удваивает ставку. Игрок играет до тех пор пока не выиграет. Случайная величина --- его выигрышь. Вычислить мат. ожидание и дисперсию.
#+end_task
#+begin_solution org
\-
| /       | <               |                 |                   |           |                                             |           |
| \(\xi\) | \(1\)           | \(1 = 2 - 1\)   | \(1 = 4 - 2 - 1\) | \(\dots\) | \(1 = 2^{n - 1} - \sum_{i = 0}^{n - 2}2^i\) | \(\dots\) |
|---------+-----------------+-----------------+-------------------+-----------+---------------------------------------------+-----------|
| \(p\)   | \(\frac{1}{2}\) | \(\frac{1}{4}\) | \(\frac{1}{8}\)   | \(\dots\) | \(\frac{1}{2^n}\)                           | \(\dots\) |
\[ E\xi = 1 \cdot \sum_{n = 1}^\infty \frac{1}{2^n} = \frac{\frac{1}{2}}{1 - \frac{1}{2}} = 1 \]
\[ D\xi = 1^2 \cdot \sum_{n = 1}^\infty \frac{1}{2^n} - 1^2 = 0 \]
#+end_solution
#+begin_task org
Та же задача, только \(n\) --- ограничено
#+end_task
#+begin_solution org
| /       | <               |                 |                 |           |                         |                         |                               |   |
| \(\xi\) | \(1\)           | \(1\)           | \(1\)           | \(\dots\) |                       1 |                       1 | \(-\sum_{i = 0}^{n - 1}2 ^i\) |   |
|---------+-----------------+-----------------+-----------------+-----------+-------------------------+-------------------------+-------------------------------+---|
| \(p\)   | \(\frac{1}{2}\) | \(\frac{1}{4}\) | \(\frac{1}{8}\) | \(\dots\) | \(\frac{1}{2^{n - 1}}\) | \(\frac{1}{2^{n + 1}}\) | \(\frac{1}{2^{n + 1}}\)       |   |
\[ E\xi = 1\cdot \sum_{k = 1}^{n - 1} \frac{1}{2^k} + 1\cdot \frac{1}{2^{k + 1}} - \frac{1}{2^{n + 1}}\cdot \sum_{k = 0}^{n - 1}2^k =  \]

#+end_solution

